# Install dependencies
brew "gcc"
brew "git"
brew "node"
brew "openjdk@17"
brew "python@3.10"
brew "svn"

# Software to install
brew "abcde"
brew "bat"
brew "dust"
brew "duf"
brew "exa"
brew "eye-d3"
brew "fd"
brew "figlet"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "jdtls"
brew "jq"
brew "keychain"
brew "lame"
brew "maven"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

tap "mvndaemon/homebrew-mvnd"
brew "mvnd"

tap "universal-ctags/universal-ctags"
brew "universal-ctags", args: ["HEAD"]

# LSP and linters
brew "efm-langserver"
brew "flake8"
brew "lua-language-server"
brew "markdownlint-cli"
brew "shellcheck"
brew "vale"
