# Install software here
cask_args appdir: '/Applications'

# Taps
tap "coursier/formulas"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Required for installing other things
brew "node"
brew "python"
brew "ruby"

# Software to install
brew "bandwhich"
brew "bat"
brew "docker-compose"
brew "exa"
brew "fd"
brew "figlet"
brew "fzf"
brew "git"
brew "gnupg"
brew "google-java-format"
brew "jq"
brew "maven"
brew "pandoc"
brew "rsync"
brew "sbt"
brew "scala"
brew "svn"
brew "the_silver_searcher"
brew "tig"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "heroku/brew/heroku"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

cask "alfred"
cask "avira-antivirus"
cask "bartender"
cask "docker"
cask "dropbox"
cask "ferdi"
cask "firefox"
cask "font-comic-neue"
cask "font-fira-code"
cask "font-open-sans"
cask "gitup"
cask "google-chrome"
cask "hammerspoon"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "macpass"
cask "macvim"
cask "microsoft-office"
cask "postbox"
cask "remember-the-milk"
cask "rocket"
cask "spotify"
cask "tunnelblick"

mas "NordVPN IKE", id: 1116599239
mas "Pixelmator", id: 407963104

